Catalogs/Peripherals.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Peripherals</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>EquipmentType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PeripheralTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeviceIdentifier</Name>
					<Comment>Unique identifier of hardware standard device</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeviceDisconnected</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeviceIsInUse</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HardwareDriver</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HardwareDrivers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Parameters</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Workplace</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Workplaces</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReinstallationRequired</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InstallationIsRequired</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRule</Name>
					<Comment>Intended for exchange with offline equipment</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ExchangeWithPeripheralsOfflineRules</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InfobaseNode</Name>
					<Comment>Intended for exchange with offline equipment</Comment>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ExchangeWithPeripheralsOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SerialNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ComponentVersion</Name>
					<Comment>Component Version</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteDriverHandler</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PeripheralDriverHandlers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Peripherals/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

// Procedure performs the device parameter initialization.
//
Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If IsNew() Then
		Parameters = New ValueStorage(New Structure());
	EndIf;
	
EndProcedure // BeforeWrite()

// Procedure checks the catalog
// item description uniqueness for this computer.
Procedure FillCheckProcessing(Cancel, CheckedAttributes)

	If Not IsBlankString(Description) Then
		Query = New Query("
		|SELECT
		|    1
		|FROM
		|    Catalog.Peripherals AS Peripherals
		|WHERE
		|    Peripherals.Description = &Description
		|    AND Peripherals.Workplace = &Workplace
		|    AND Peripherals.Ref <> &Ref
		|");

		Query.SetParameter("Description", Description);
		Query.SetParameter("Workplace", Workplace);
		Query.SetParameter("Ref"      , Ref);

		If Not Query.Execute().IsEmpty() Then
			CommonUseClientServer.MessageToUser(NStr("en='Nonunique item description is specified. Specify unique name.'"), ThisObject, , , Cancel);
		EndIf;
	EndIf;

EndProcedure // FillCheckProcessing()

// Procedure performs attribute cleaning which shouldn't be copied.
// The following attributes are cleared when you copy:
// "Parameters"    - device parameters are reset to Undefined;
// "Description"   - other than the original description is set;
Procedure OnCopy(CopiedObject)
	
	DeviceIsInUse = True;
	Parameters = Undefined;

	Description = NStr("en='%Description% (copy)'");
	Description = StrReplace(Description, "%Description%", CopiedObject.Description);
	
EndProcedure

// On write
//
Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;

EndProcedure

#EndRegion

#EndIf
